// 一个整数  加上100是一个完全平方数  再加上168又是一个完全平方数 该数是多少？

//程序分析


//x+100=n*n, x+100+168=m*m

// m*m-n*n=(m+n)*(m-n)=168

//假设m+n=i  m-n=j  i*j=168   

//m=(i+j)/2  n=(i-j)/2

//i*j=168 j>=2 

//1<i<168/2+1


 




#include <stdio.h>
 
int main (void)
{
    int  i, j, m, n, x;   //设置变量 
    for (i = 1; i < 168 / 2 + 1; i++)
    {
        if (168 % i == 0)
        {
            j = 168 / i;
            if ( i > j && (i + j) % 2 == 0 && (i - j) % 2 == 0)   //2023年10月30日16:49:36 只有这里我还是没有明白 
            {
                m = (i + j) / 2;
                n = (i - j) / 2;
                x = n * n - 100;
                printf ("%d + 100 = %d * %d\n", x, n, n);
                printf ("%d + 268 = %d * %d\n", x, m, m);
            }
        }
    }
    return 0;
}
